simulation/openfoam/tjunction_3d/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (water oil);

water
{
    transportModel  Newtonian;
    nu              1e-06;
    rho             1000;
}

oil
{
    transportModel  Newtonian;
    nu              5e-05;
    rho             960;
}

sigma           0.03;

// ************************************************************************* //


