simulation/openfoam/tjunction_3d/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Parallel decomposition for 3D case
// Adjust numberOfSubdomains based on available CPU cores

numberOfSubdomains 4;

method          scotch;

// Alternative: hierarchical decomposition
// method          hierarchical;
// hierarchicalCoeffs
// {
//     n           (2 2 1);
//     order       xyz;
// }

// ************************************************************************* //


